# Analyzing CIA factbook using SQL

## The aim is to obtain some basic information from the database
- Minimum population.
- Maximum population.
- Minimum population growth.
- Maximum population growth.
- Countrie(s) with the minimum population.
- Countrie(s) with the maximum population.
- Find the average population.
- Find the average area.
- Find the countries which..
    - Has population above average.
    - Has area  below average.
- Which countries have the highest ratios of water to land? Which countries have more water than land?
- Which countries will add the most people to their population next year?
- Which countries have a higher death rate than birth rate?

### Analysis Outline
1. Import all the libraries needed
2. Create the connection
3. Create a sql query that will search for all the tables in the database
4. Read the query created above into pandas.
5. Inspect to see what are the tables in the database.
6. Select the table of interest and display some few rows to get the overview of the dataset.
7. Write a query to get the minimum population.
8. Write a query to get the maximum population.
9. Write a query to get the min pop growth.
10. Write a query to get the max pop growth.
11. Write a query to get countries with minimum population.
12. Write a query to get countries with maximum population.
13. Write a query to get average population
14. Write a query to get average area
15. Write a query to get countries
    - Which has population above average
    - Which has area below average
16. Cuntries have the highest ratios of water to land? Which countries have more water than land.

In [3]:
#import all the libraries needed
import sqlite3
import pandas as pd

In [2]:
#Create the connection instances
conn =  sqlite3.connect('factbook.db')

In [4]:
#this querry will call all the tables that are in our database
tables = '''
            SELECT
                *
            FROM sqlite_master 
            WHERE type ="table";'''

In [5]:
#if you where to work with the table off line then you can assign it to a variable and work from there
#working with the table offline undermine the sql powers so that will not be the path we follow
table_factbook = pd.read_sql_query(tables, conn)

In [6]:
table_factbook

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

### Observation:
- There are two tables:
- We will use the table called facts

In [24]:
#we are writting a query that will show the first five rows of the dataset
query_facts = '''
                  SELECT
                      *
                    FROM facts
                    LIMIT 5;
                    
                    '''
pd.read_sql_query(query_facts,conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

### Observation:
- The dataset is relatively simple one with few columns

In [25]:
#querry to get minimum population from the table
min_pop_query = '''
                    SELECT
                    MIN(population)
                    FROM facts'''
pd.read_sql_query(min_pop_query,conn)

   MIN(population)
0                0

### Observation:
- The minimum population for the given table is 0
- This is a suspect, we will have to investgate later

In [26]:
#query to get the maximum population from the table
max_pop_query = '''
                    SELECT
                    MAX(population)
                    FROM facts'''
pd.read_sql_query(max_pop_query, conn)

   MAX(population)
0       7256490011

### Observation:
- the max population is 7256490011

In [29]:
#querry to get the min pop growth
min_pop_growth_query = '''
                        SELECT
                        MIN(population_growth)
                        FROM facts
                        '''
pd.read_sql_query(min_pop_growth_query,conn)

   MIN(population_growth)
0                     0.0

### Observation:
- The minimum populuation growht is 0

In [30]:
#query to get the max pop growth

max_pop_growth_query = '''
                        SELECT
                        MAX(population_growth)
                        FROM facts
                        '''
pd.read_sql_query(max_pop_growth_query,conn)

   MAX(population_growth)
0                    4.02

### Observation:
- The max population growth is 4.02

In [33]:
#querry to obtain countrie(s), with min population

country_min_population = '''
                            SELECT
                            name
                            FROM facts
                            WHERE
                            population == 0;
                            '''
pd.read_sql_query(country_min_population, conn)

         name
0  Antarctica

### Observation:
- The country with the lowest population is Antarctica, yes this is sketchy as Antarctica is not a country

In [34]:
#querry to obtain countrie(s), with max population

country_max_population = '''
                            SELECT
                            name
                            FROM facts
                            WHERE
                            population == 7256490011;
                            '''
pd.read_sql_query(country_max_population, conn)

    name
0  World

### Observation:
- The country with the max population is World...yes here we go again

In [35]:
#query to obtain average population
avg_population_query = '''
                        SELECT avg(population)
                        FROM facts
                        ;
                    '''
pd.read_sql_query(avg_population_query, conn)

   avg(population)
0     6.209493e+07

### Observation:
- The average poplation is 62094930

In [41]:
#query to obtain the average area

avg_area_query = '''
                    SELECT avg(area)
                    FROM facts
                    ;
                    '''
avg_table = pd.read_sql_query(avg_area_query,conn)
avg_area = avg_table['avg(area)'][0]

### Observation:
- The average area is 555093.546185

In [48]:
#query to obtain the countries with pop above avg

countries_above_avg = '''
                        SELECT name AS country
                        FROM facts
                        WHERE population > 62094930
                        ;
                        '''
countries_avg_above_table = pd.read_sql_query(countries_above_avg, conn)
countries_avg_above_table['country']

0                            Bangladesh
1                                Brazil
2                                 China
3     Congo, Democratic Republic of the
4                                 Egypt
5                              Ethiopia
6                                France
7                               Germany
8                                 India
9                             Indonesia
10                                 Iran
11                                Japan
12                               Mexico
13                              Nigeria
14                             Pakistan
15                          Philippines
16                               Russia
17                             Thailand
18                               Turkey
19                       United Kingdom
20                        United States
21                              Vietnam
22                       European Union
23                                World
Name: country, dtype: object

In [52]:
#query to obtain the countries with area above avg

countries_area_bellow_avg = '''
                        SELECT name AS country
                        FROM facts
                        WHERE area < 555093.546185
                        ;
                        '''
pd.read_sql_query(countries_area_bellow_avg, conn)

                 country
0                Albania
1                Andorra
2    Antigua and Barbuda
3                Armenia
4                Austria
..                   ...
196           Gaza Strip
197      Paracel Islands
198      Spratly Islands
199            West Bank
200       Western Sahara

[201 rows x 1 columns]

In [53]:
countries_more_water = '''
                            SELECT name AS country
                            FROM facts
                            WHERE area_water > area_land
                            ;
                            '''
pd.read_sql_query(countries_more_water,conn)

                          country
0  British Indian Ocean Territory
1                  Virgin Islands

In [ ]:
countries_more_death = '''
                        SELECT name as country
                        FROM facts
                        WHERE birth_rate > death_rate
                        ;
                        '''
pd.r